app/views/messages/create.json.jbuilder

INSERT INTO `messages` (`content`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('', '_ChatSpace_画面キャプチャ.png', 2, 1, '2019-03-13 10:36:49', '2019-03-13 10:36:49')
---
json.name @message.user.name
json.date @message.created_at.strftime("%Y/%m/%d %H:%M")