app/views/groups/_form.html.haml

SELECT `users`.* FROM `users`
SELECT `users`.id FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 1
---
      / グループ作成機能の追加時はここにcollection_check_boxesの記述を入れてください
      / = f.collection_check_boxes :user_ids, User.all, :id, :name
      .chat-group-users
        - @group.users.each do |user|
          .chat-group-user.clearfix.js-chat-member{id: "chat-group-user-#{user.id}"}