app/controllers/groups_controller.rb

INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('New York', '2019-03-02 14:44:17', '2019-03-02 14:44:17')
---
  def create
    @group = Group.new(group_params)
    # @group.users << current_user
    if @group.save

UPDATE `groups` SET `name` = 'New Yor', `updated_at` = '2019-03-02 14:58:41' WHERE `groups`.`id` = 1
---
  def update
    if @group.update(group_params)

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
---
  def set_group
    @group = Group.find(params[:id])