app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (name LIKE('%%'))
---
  def index
    #入力された値からあいまい検索 ログイン中のアカウントを除く
    @users = User.where('name LIKE(?)', "%#{params[:name]}%")

UPDATE `users` SET `name` = 'akizo', `email` = 'akizo@gmail.com', `updated_at` = '2019-03-16 06:25:03' WHERE `users`.`id` = 1
---
  def update
    if current_user.update(user_params)